ART-Badge/SDK/libraries/inc/peripheral/rtl876x_i2s.h
/**
*********************************************************************************************************
*               Copyright(c) 2017, Realtek Semiconductor Corporation. All rights reserved.
*********************************************************************************************************
* \file     rtl876x_i2s.h
* \brief    The header file of the peripheral I2S driver.
* \details  This file provides all I2S firmware functions.
* \author   elliot chen
* \date     2017-12-06
* \version  v1.0
* *********************************************************************************************************
*/


#ifndef _RTL876x_I2S_H
#define _RTL876x_I2S_H

#ifdef __cplusplus
extern "C" {
#endif

/**
 * \addtogroup  IO          Peripheral Drivers
 * \defgroup    I2S         I2S
 *
 * \brief       Manage the I2S peripheral functions.
 *
 * \ingroup     IO
 */

/*============================================================================*
 *                         Includes
 *============================================================================*/
#include "rtl876x.h"

/*============================================================================*
 *                         Types
 *============================================================================*/

/**
 * \defgroup    I2S_Exported_Types Inti Params Struct
 *
 * \ingroup     I2S
 */

/**
 * \brief       I2S initialize parameters.
 *
 * \ingroup     I2S_Exported_Types
 */
typedef struct
{
    uint32_t I2S_ClockSource;       /*!< Specifies the I2S clock source.
                                            This parameter can be a value of \ref I2S_Clock_Source*/
    uint32_t I2S_BClockMi;          /*!< Specifies the BLCK clock speed. BCLK = 40MHz*(I2S_BClockNi/I2S_BClockMi).
                                            This parameter must range from 1 to 0xffff */
    uint32_t I2S_BClockNi;          /*!< Specifies the BLCK clock speed.
                                            This parameter must range from 1 to 0x7FFF */
    uint32_t I2S_DeviceMode;        /*!< Specifies the I2S device mode.
                                            This parameter can be a value of \ref I2S_device_mode*/
    uint32_t I2S_ChannelType;       /*!< Specifies the channel type used for the I2S communication.
                                            This parameter can be a value of \ref I2S_Channel_Type */
    uint32_t I2S_TxChSequence;      /*!< Specifies the transmission channel seqence used for the I2S communication.
                                            This parameter can be a value of \ref I2S_Tx_Ch_Sequence*/
    uint32_t I2S_RxChSequence;      /*!< Specifies the receiving channel seqence used for the I2S communication.
                                            This parameter can be a value of \ref I2S_Rx_Ch_Sequence*/
    uint32_t I2S_DataFormat;        /*!< Specifies the I2S Data format mode.
                                            This parameter can be a value of \ref I2S_Format_Mode*/
    uint32_t I2S_TxBitSequence;     /*!< Specifies the I2S Data bits sequences.
                                            This parameter can be a value of \ref I2S_Tx_Bit_Sequence*/
    uint32_t I2S_RxBitSequence;     /*!< Specifies the I2S Data bits sequences.
                                            This parameter can be a value of \ref I2S_Rx_Bit_Sequence*/
    uint32_t I2S_DataWidth;         /*!< Specifies the I2S Data width.
                                            This parameter can be a value of \ref I2S_Data_Width */
    uint32_t I2S_MCLKOutput;        /*!< Specifies the I2S MCLK output freqency.
                                            This parameter can be a value of \ref I2S_MCLK_Output */
    uint32_t I2S_DMACmd;            /*!< Specifies the I2S DMA control.
                                            This parameter can be a value of \ref FunctionalState */
    uint32_t I2S_TxWaterlevel;      /*!< Specifies the dma watermark level in transmit mode.
                                            This parameter must range from 1 to 63 */
    uint32_t I2S_RxWaterlevel;      /*!< Specifies the dma watermark level in receive mode.
                                            This parameter must range from 1 to 63 */
} I2S_InitTypeDef;


/*============================================================================*
 *                         Register Defines
 *============================================================================*/

/* Peripheral: I2S */
/* Description: I2S register defines */

/* Register: CTRL0 -------------------------------------------------------*/
/* Description: Control register 0. Offset: 0x04. */

/* CTRL0[30]: I2S_MCLK_SEL. */
#define I2S_MCLK_SEL_POS                (30)
#define I2S_MCLK_SEL_MSK                (0x1 << I2S_MCLK_SEL_POS)
#define I2S_MCLK_SEL_CLR                (~I2S_MCLK_SEL_MSK)
/* CTRL0[29:28]: I2S_RX_CH_SEQ. */
#define I2S_RX_CH_SEQ_POS               (28)
#define I2S_RX_CH_SEQ_MSK               (0x1 << I2S_RX_CH_SEQ_POS)
#define I2S_RX_CH_SEQ_CLR               (~I2S_RX_CH_SEQ_MSK)
/* CTRL0[25]: I2S_START_RX. */
#define I2S_START_RX_POS                (25)
#define I2S_START_RX_MSK                (0x1 << I2S_START_RX_POS)
#define I2S_START_RX_CLR                (~I2S_START_RX_MSK)
/* CTRL0[24]: I2S_RX_DISABLE. */
#define I2S_RX_DISABLE_POS              (24)
#define I2S_RX_DISABLE_MSK              (0x1 << I2S_RX_DISABLE_POS)
#define I2S_RX_DISABLE_CLR              (~I2S_RX_DISABLE_MSK)
/* CTRL0[23]: I2S_RX_LSB_FIRST. */
#define I2S_RX_LSB_FIRST_POS            (23)
#define I2S_RX_LSB_FIRST_MSK            (0x1 << I2S_RX_LSB_FIRST_POS)
#define I2S_RX_LSB_FIRST_CLR            (~I2S_RX_LSB_FIRST_MSK)
/* CTRL0[22]: I2S_TX_LSB_FIRST. */
#define I2S_TX_LSB_FIRST_POS            (22)
#define I2S_TX_LSB_FIRST_MSK            (0x1 << I2S_TX_LSB_FIRST_POS)
#define I2S_TX_LSB_FIRST_CLR            (~I2S_TX_LSB_FIRST_MSK)
/* CTRL0[21:20]: I2S_TX_CH_SEQ. */
#define I2S_TX_CH_SEQ_POS               (20)
#define I2S_TX_CH_SEQ_MSK               (0x1 << I2S_TX_CH_SEQ_POS)
#define I2S_TX_CH_SEQ_CLR               (~I2S_TX_CH_SEQ_MSK)
/* CTRL0[17]: I2S_START_TX. */
#define I2S_START_TX_POS                (17)
#define I2S_START_TX_MSK                (0x1 << I2S_START_TX_POS)
#define I2S_START_TX_CLR                (~I2S_START_TX_MSK)
/* CTRL0[16]: I2S_TX_DISABLE. */
#define I2S_TX_DISABLE_POS              (16)
#define I2S_TX_DISABLE_MSK              (0x1 << I2S_TX_DISABLE_POS)
#define I2S_TX_DISABLE_CLR              (~I2S_TX_DISABLE_MSK)
/* CTRL0[13:12]: I2S_DATA_WIDTH. */
#define I2S_DATA_WIDTH_POS              (12)
#define I2S_DATA_WIDTH_MSK              (0x3 << I2S_DATA_WIDTH_POS)
#define I2S_DATA_WIDTH_CLR              (~I2S_DATA_WIDTH_MSK)
/* CTRL0[11]: I2S_CHANNEL_TYPE. */
#define I2S_CHANNEL_TYPE_POS            (11)
#define I2S_CHANNEL_TYPE_MSK            (0x1 << I2S_CHANNEL_TYPE_POS)
#define I2S_CHANNEL_TYPE_CLR            (~I2S_CHANNEL_TYPE_MSK)
/* CTRL0[9:8]: I2S_DATA_FORMAT. */
#define I2S_DATA_FORMAT_POS             (8)
#define I2S_DATA_FORMAT_MSK             (0x3 << I2S_DATA_FORMAT_POS)
#define I2S_DATA_FORMAT_CLR             (~I2S_DATA_FORMAT_MSK)
/* CTRL0[7]: I2S_CTRL_MODE. */
#define I2S_CTRL_MODE_POS              (7)
#define I2S_CTRL_MODE_MSK              (0x1 << I2S_CTRL_MODE_POS)
#define I2S_CTRL_MODE_CLR              (~I2S_CTRL_MODE_MSK)
/* CTRL0[4]: I2S_SLAVE_DATA_SEL. */
#define I2S_SLAVE_DATA_SEL_POS          (4)
#define I2S_SLAVE_DATA_SEL_MSK          (0x1 << I2S_SLAVE_DATA_SEL_POS)
#define I2S_SLAVE_DATA_SEL_CLR          (~I2S_SLAVE_DATA_SEL_MSK)
/* CTRL0[3]: I2S_SLAVE_CLK_SEL. */
#define I2S_SLAVE_CLK_SEL_POS           (3)
#define I2S_SLAVE_CLK_SEL_MSK           (0x1 << I2S_SLAVE_CLK_SEL_POS)
#define I2S_SLAVE_CLK_SEL_CLR           (~I2S_SLAVE_CLK_SEL_MSK)
/* CTRL0[0]: I2S_RESET. */
#define I2S_RESET_POS                   (0)
#define I2S_RESET_MSK                   (0x1 << I2S_RESET_POS)
#define I2S_RESET_CLR                   (~I2S_RESET_MSK)

/* Register: CTRL1 -------------------------------------------------------*/
/* Description: Control register 1. Offset: 0x08. */

/* CTRL1[30]: I2S_TX_IDLE. */
#define I2S_TX_IDLE_POS                 (30)
#define I2S_TX_IDLE_MSK                 (0x1 << I2S_TX_IDLE_POS)
#define I2S_TX_IDLE_CLR                 (~I2S_TX_IDLE_MSK)
/* CTRL1[29]: I2S_RF_EMPTY. */
#define I2S_RF_EMPTY_POS                (29)
#define I2S_RF_EMPTY_MSK                (0x1 << I2S_RF_EMPTY_POS)
#define I2S_RF_EMPTY_CLR                (~I2S_RF_EMPTY_MSK)
/* CTRL1[28]: I2S_TF_EMPTY. */
#define I2S_TF_EMPTY_POS                (28)
#define I2S_TF_EMPTY_MSK                (0x1 << I2S_TF_EMPTY_POS)
#define I2S_TF_EMPTY_CLR                (~I2S_TF_EMPTY_MSK)
/* CTRL1[27]: I2S_RX_FULL. */
#define I2S_RX_FULL_POS                 (27)
#define I2S_RX_FULL_MSK                 (0x1 << I2S_RX_FULL_POS)
#define I2S_RX_FULL_CLR                 (~I2S_RX_FULL_MSK)
/* CTRL1[26]: I2S_TX_FULL. */
#define I2S_TX_FULL_POS                 (26)
#define I2S_TX_FULL_MSK                 (0x1 << I2S_TX_FULL_POS)
#define I2S_TX_FULL_CLR                 (~I2S_TX_FULL_MSK)
/* CTRL1[25]: I2S_READY_TO_RX. */
#define I2S_READY_TO_RX_POS             (25)
#define I2S_READY_TO_RX_MSK             (0x1 << I2S_READY_TO_RX_POS)
#define I2S_READY_TO_RX_CLR             (~I2S_READY_TO_RX_MSK)
/* CTRL1[24]: I2S_READY_TO_TX. */
#define I2S_READY_TO_TX_POS             (24)
#define I2S_READY_TO_TX_MSK             (0x1 << I2S_READY_TO_TX_POS)
#define I2S_READY_TO_TX_CLR             (~I2S_READY_TO_TX_MSK)

/* CTRL1[23]: I2S_RX_SNK_LR_SWAP. */
#define I2S_RX_SNK_LR_SWAP_POS          (23)
#define I2S_RX_SNK_LR_SWAP_MSK          (0x1 << I2S_RX_SNK_LR_SWAP_POS)
#define I2S_RX_SNK_LR_SWAP_CLR          (~I2S_RX_SNK_LR_SWAP_MSK)
/* CTRL1[22]: I2S_RX_SNK_BYTE_SWAP. */
#define I2S_RX_SNK_BYTE_SWAP_POS        (22)
#define I2S_RX_SNK_BYTE_SWAP_MSK        (0x1 << I2S_RX_SNK_BYTE_SWAP_POS)
#define I2S_RX_SNK_BYTE_SWAP_CLR        (~I2S_RX_SNK_BYTE_SWAP_MSK)
/* CTRL1[21]: I2S_TX_SRC_LR_SWAP. */
#define I2S_TX_SRC_LR_SWAP_POS          (21)
#define I2S_TX_SRC_LR_SWAP_MSK          (0x1 << I2S_TX_SRC_LR_SWAP_POS)
#define I2S_TX_SRC_LR_SWAP_CLR          (~I2S_TX_SRC_LR_SWAP_MSK)
/* CTRL1[20]: I2S_TX_SRC_BYTE_SWAP. */
#define I2S_TX_SRC_BYTE_SWAP_POS        (20)
#define I2S_TX_SRC_BYTE_SWAP_MSK        (0x1 << I2S_TX_SRC_BYTE_SWAP_POS)
#define I2S_TX_SRC_BYTE_SWAP_CLR        (~I2S_TX_SRC_BYTE_SWAP_MSK)
/* CTRL1[17]: I2S_CLK_128FS. */
#define I2S_CLK_128FS_POS               (17)
#define I2S_CLK_128FS_MSK               (0x1 << I2S_CLK_128FS_POS)
#define I2S_CLK_128FS_CLR               (~I2S_CLK_128FS_MSK)
/* CTRL1[16]: I2S_CLK_40M. */
#define I2S_CLK_128_FS_POS              (16)
#define I2S_CLK_128_FS_MSK              (0x1 << I2S_CLK_128_FS_POS)
#define I2S_CLK_128_FS_CLR              (~I2S_CLK_128_FS_MSK)
/* CTRL1[13]: I2S_CLR_RX_ERR_CNT. */
#define I2S_CLR_RX_ERR_CNT_POS          (13)
#define I2S_CLR_RX_ERR_CNT_MSK          (0x1 << I2S_CLR_RX_ERR_CNT_POS)
#define I2S_CLR_RX_ERR_CNT_CLR          (~I2S_CLR_RX_ERR_CNT_MSK)
/* CTRL1[12]: I2S_CLR_TX_ERR_CNT. */
#define I2S_CLR_TX_ERR_CNT_POS          (12)
#define I2S_CLR_TX_ERR_CNT_MSK          (0x1 << I2S_CLR_TX_ERR_CNT_POS)
#define I2S_CLR_TX_ERR_CNT_CLR          (~I2S_CLR_TX_ERR_CNT_MSK)
/* CTRL1[7:0]: I2S_FRAME_SYNC_OFFSET. */
#define I2S_FRAME_SYNC_OFFSET_POS       (0)
#define I2S_FRAME_SYNC_OFFSET_MSK       (0xFF << I2S_FRAME_SYNC_OFFSET_POS)
#define I2S_FRAME_SYNC_OFFSET_CLR       (~I2S_FRAME_SYNC_OFFSET_MSK)
#define I2S_FRAME_SYNC_OFFSET_DEFAULT   (0x81 << I2S_FRAME_SYNC_OFFSET_POS)

/* Register: DSP_INT_CR -------------------------------------------------------*/
/* Description:Interrupt clearregister. Offset: 0x0C. */

/* DSP_INT_CR[1]: I2S_RX_CLEAR_INT. */
#define I2S_RX_CLEAR_INT_POS            (1)
#define I2S_RX_CLEAR_INT_MSK            (0x1 << I2S_RX_CLEAR_INT_POS)
#define I2S_RX_CLEAR_INT_CLR            (~I2S_RX_CLEAR_INT_MSK)
/* DSP_INT_CR[0]: I2S_TX_CLEAR_INT. */
#define I2S_TX_CLEAR_INT_POS            (0)
#define I2S_TX_CLEAR_INT_MSK            (0x1 << I2S_TX_CLEAR_INT_POS)
#define I2S_TX_CLEAR_INT_CLR            (~I2S_TX_CLEAR_INT_MSK)

/* Register: FIFO_SR -------------------------------------------------------*/
/* Description: FIFO status register. Offset: 0x14. */

