ART-Badge/SDK/libraries/inc/peripheral/rtl876x_i2s.h
/* FIFO_SR[13:8]: I2S_RX_FIFO_DEPTH_CNT. */
#define I2S_RX_FIFO_DEPTH_CNT_POS       (8)
#define I2S_RX_FIFO_DEPTH_CNT_MSK       (0x3F << I2S_RX_FIFO_DEPTH_CNT_POS)
#define I2S_RX_FIFO_DEPTH_CNT_CLR       (~I2S_RX_FIFO_DEPTH_CNT_MSK)
/* FIFO_SR[5:0]: I2S_TX_FIFO_DEPTH_CNT. */
#define I2S_TX_FIFO_DEPTH_CNT_POS       (0)
#define I2S_TX_FIFO_DEPTH_CNT_MSK       (0x3F << I2S_TX_FIFO_DEPTH_CNT_POS)
#define I2S_TX_FIFO_DEPTH_CNT_CLR       (~I2S_TX_FIFO_DEPTH_CNT_MSK)

/* Register: ERROR_CNT_SR -------------------------------------------------------*/
/* Description: Error counter status register. Offset: 0x18. */

/* ERROR_CNT_SR[15:8]: I2S_RX_ERR_CNT. */
#define I2S_RX_ERR_CNT_POS              (8)
#define I2S_RX_ERR_CNT_MSK              (0xFF << I2S_RX_ERR_CNT_POS)
#define I2S_RX_ERR_CNT_CLR              (~I2S_RX_ERR_CNT_MSK)
/* ERROR_CNT_SR[7:0]: I2S_TX_ERR_CNT. */
#define I2S_TX_ERR_CNT_POS              (0)
#define I2S_TX_ERR_CNT_MSK              (0xFF << I2S_TX_ERR_CNT_POS)
#define I2S_TX_ERR_CNT_CLR              (~I2S_TX_ERR_CNT_MSK)

/* Register: BCLK_DIV -------------------------------------------------------*/
/* Description: BCLK divider register. Offset: 0x1C. */

/* BCLK_DIV[31]: I2S_MI_NI_UPDATE. */
#define I2S_MI_NI_UPDATE_POS        (31)
#define I2S_MI_NI_UPDATE_MSK        ((uint32_t)0x1 << I2S_MI_NI_UPDATE_POS)
#define I2S_MI_NI_UPDATE_CLR        (~I2S_MI_NI_UPDATE_MSK)
/* BCLK_DIV[30:16]: I2S_BCLK_NI. */
#define I2S_BCLK_NI_POS             (16)
#define I2S_BCLK_NI_MSK             (0x7FFF << I2S_BCLK_NI_POS)
#define I2S_BCLK_NI_CLR             (~I2S_BCLK_NI_MSK)
/* BCLK_DIV[15:0]: I2S_BCLK_MI. */
#define I2S_BCLK_MI_POS             (0)
#define I2S_BCLK_MI_MSK             (0xFFFF << I2S_BCLK_MI_POS)
#define I2S_BCLK_MI_CLR             (~I2S_BCLK_MI_MSK)

/* Register: DMA_TRDLR -------------------------------------------------------*/
/* Description: DMA transmit receive data level register. Offset: 0x20. */

/* DMA_TRDLR[5:0]: I2S_TX_DMA_BURST_SIZE. */
#define I2S_TX_DMA_BURST_SIZE_POS   (0)
#define I2S_TX_DMA_BURST_SIZE_MSK   (0x3F << I2S_TX_DMA_BURST_SIZE_POS)
#define I2S_TX_DMA_BURST_SIZE_CLR   (~I2S_TX_DMA_BURST_SIZE_MSK)
/* DMA_TRDLR[13:8]: I2S_RX_DMA_BURST_SIZE. */
#define I2S_RX_DMA_BURST_SIZE_POS   (8)
#define I2S_RX_DMA_BURST_SIZE_MSK   (0x3F << I2S_RX_DMA_BURST_SIZE_POS)
#define I2S_RX_DMA_BURST_SIZE_CLR   (~I2S_RX_DMA_BURST_SIZE_MSK)

/* Register: PERIPH_AUDIO_CLK_224 -------------------------------------------------------*/
/* Description: peri on register. address: 0x40000224. */
#define PERIPH_AUDIO_CLK_224        0x40000224
/* PERIPH_AUDIO_CLK_224[3]: I2S0_EXT_CODEC. */
#define I2S0_EXT_CODEC_POS         (3)
#define I2S0_EXT_CODEC_MSK         (0x1 << I2S0_EXT_CODEC_POS)
#define I2S0_EXT_CODEC_CLR         (~I2S0_EXT_CODEC_MSK)

/* Register: PERIPH_AUDIO_CLK_228 -------------------------------------------------------*/
/* Description: peri on register. address: 0x40000228. */
#define PERIPH_AUDIO_CLK_228        0x40000228
/* PERIPH_AUDIO_CLK_228[4]: I2S_MCLK_OUTPUT. */
#define I2S_MCLK_OUTPUT_POS         (4)
#define I2S_MCLK_OUTPUT_MSK         (0x1 << I2S_MCLK_OUTPUT_POS)
#define I2S_MCLK_OUTPUT_CLR         (~I2S_MCLK_OUTPUT_MSK)


/*============================================================================*
 *                         Constants
 *============================================================================*/

/**
 * \defgroup    I2S_Exported_Constants  Macro Defines
 *
 * \ingroup     I2S
 */

#define IS_I2S_ALL_PERIPH(PERIPH) (((PERIPH) == I2S0) || \
                                   ((PERIPH) == I2S1))

/**
 * \defgroup    I2S_Clock_Source I2S Clock Source
 * \{
 * \ingroup     I2S_Exported_Constants
 */
#define I2S_CLK_40M                                 (I2S_CLK_128_FS_MSK)
#define I2S_CLK_128fs                               (I2S_CLK_128FS_MSK)
#define I2S_CLK_256fs                               ((uint32_t)(0x00))
/** \} */

#define IS_I2S_CLK_SOURCE(CLK) (((CLK) == I2S_CLK_40M) || \
                                ((CLK) == I2S_CLK_128fs) || \
                                ((CLK) == I2S_CLK_256fs))

/**
 * \defgroup    I2S_Device_Mode I2S Device Mode
 * \{
 * \ingroup     I2S_Exported_Constants
 */

#define I2S_DeviceMode_Master                       ((uint32_t)0x00)
#define I2S_DeviceMode_Slave                        (I2S_SLAVE_DATA_SEL_MSK )//| I2S_SLAVE_CLK_SEL_MSK)
/** \} */

#define IS_I2S_DEVICE_MODE(DEVICE)      (((DEVICE) == I2S_DeviceMode_Master) || ((DEVICE) == I2S_DeviceMode_Slave))

/**
 * \defgroup    I2S_Mode I2S Mode
 * \{
 * \ingroup     I2S_Exported_Constants
 */
#define I2S_MODE_TX                                 (I2S_START_TX_MSK)
#define I2S_MODE_RX                                 (I2S_START_RX_MSK)
/** \} */

#define IS_I2S_MODE(MODE)               (((MODE) == I2S_MODE_TX) || ((MODE) == I2S_MODE_RX))

/**
 * \defgroup    I2S_Channel_Type I2S Channel Type
 * \{
 * \ingroup     I2S_Exported_Constants
 */
#define I2S_Channel_Mono                            (I2S_CHANNEL_TYPE_MSK)
#define I2S_Channel_stereo                          ((uint32_t)(0x0))
/** \} */

#define IS_I2S_CHANNEL_TYPE(TYPE)       (((TYPE) == I2S_Channel_Mono) || ((TYPE) == I2S_Channel_stereo))

/**
 * \defgroup    I2S_Tx_Ch_Sequence I2S Transmission Channel Sequence
 * \{
 * \ingroup     I2S_Exported_Constants
 */
#define I2S_TX_CH_L_R                           (0)
#define I2S_TX_CH_R_L                           ((uint32_t)0x01 << I2S_TX_CH_SEQ_POS)
#define I2S_TX_CH_L_L                           ((uint32_t)0x02 << I2S_TX_CH_SEQ_POS)
#define I2S_TX_CH_R_R                           ((uint32_t)0x03 << I2S_TX_CH_SEQ_POS)
/** \} */

#define IS_I2S_TX_CH_SEQ(SEQ)       (((SEQ) == I2S_TX_CH_L_R) || ((SEQ) == I2S_TX_CH_R_L) || \
                                     ((SEQ) == I2S_TX_CH_L_L) || ((SEQ) == I2S_TX_CH_R_R))

/**
 * \defgroup    I2S_Rx_Ch_Sequence I2S Receiving Channel Sequence
 * \{
 * \ingroup     I2S_Exported_Constants
 */
#define I2S_RX_CH_L_R                           (0)
#define I2S_RX_CH_R_L                           ((uint32_t)0x01 << I2S_RX_CH_SEQ_POS)
#define I2S_RX_CH_L_L                           ((uint32_t)0x02 << I2S_RX_CH_SEQ_POS)
#define I2S_RX_CH_R_R                           ((uint32_t)0x03 << I2S_RX_CH_SEQ_POS)
/** \} */

#define IS_I2S_RX_CH_SEQ(SEQ)       (((SEQ) == I2S_RX_CH_L_R) || ((SEQ) == I2S_RX_CH_R_L) || \
                                     ((SEQ) == I2S_RX_CH_L_L) || ((SEQ) == I2S_RX_CH_R_R))

/**
 * \defgroup    I2S_Format_Mode I2S Format Mode
 * \{
 * \ingroup     I2S_Exported_Constants
 */
#define I2S_Mode                                    ((uint32_t)(0x00 << I2S_DATA_FORMAT_POS))
#define Left_Justified_Mode                         ((uint32_t)(0x01 << I2S_DATA_FORMAT_POS))
#define PCM_Mode_A                                  ((uint32_t)(0x02 << I2S_DATA_FORMAT_POS))
#define PCM_Mode_B                                  ((uint32_t)(0x03 << I2S_DATA_FORMAT_POS))
/** \} */

#define IS_I2S_DATA_FORMAT(FORMAT)      (((FORMAT) == I2S_Mode) || ((FORMAT) == Left_Justified_Mode) || \
                                         ((FORMAT) == PCM_Mode_A) || ((FORMAT) == PCM_Mode_B))

/**
 * \defgroup    I2S_Tx_Bit_Sequence I2S Tx Bit Sequence
 * \{
 * \ingroup     I2S_Exported_Constants
 */
#define I2S_TX_MSB_First                            ((uint32_t)0x0)
#define I2S_TX_LSB_First                            (I2S_TX_LSB_FIRST_MSK)
/** \} */

#define IS_I2S_TX_BIT_SEQ(SEQ)      (((SEQ) == I2S_TX_MSB_First) || ((SEQ) == I2S_TX_LSB_First))

/**
 * \defgroup    I2S_Rx_Bit_Sequence I2S Rx Bit Sequence
 * \{
 * \ingroup     I2S_Exported_Constants
 */
#define I2S_RX_MSB_First                            ((uint32_t)0x0)
#define I2S_RX_LSB_First                            (I2S_RX_LSB_FIRST_MSK)
/** \} */

#define IS_I2S_RX_BIT_SEQ(SEQ)      (((SEQ) == I2S_RX_MSB_First) || ((SEQ) == I2S_RX_LSB_First))

/**
 * \defgroup    I2S_Data_Width I2S Data Width
 * \{
 * \ingroup     I2S_Exported_Constants
 */

#define I2S_Width_16Bits                            ((uint32_t)(0x00 << I2S_DATA_WIDTH_POS))
#define I2S_Width_24Bits                            ((uint32_t)(0x02 << I2S_DATA_WIDTH_POS))
#define I2S_Width_8Bits                             ((uint32_t)(0x03 << I2S_DATA_WIDTH_POS))
/** \} */

#define IS_I2S_DATA_WIDTH(WIDTH)        (((WIDTH) == I2S_Width_16Bits) || \
                                         ((WIDTH) == I2S_Width_24Bits) || \
                                         ((WIDTH) == I2S_Width_8Bits))

/**
 * \defgroup    I2S_MCLK_Output I2S MCLK Output
 * \{
 * \ingroup     I2S_Exported_Constants
 */
#define I2S_MCLK_128fs                              ((uint32_t)0x0)
#define I2S_MCLK_256fs                              (I2S_MCLK_SEL_MSK)
/** \} */

#define IS_I2S_MCLK_OUTPUT_TYPE(TYPE)       (((TYPE) == I2S_MCLK_128fs) || ((TYPE) == I2S_MCLK_256fs))

/**
 * \defgroup    I2S_DMA_Cmd I2S DMA Cmd
 * \{
 * \ingroup     I2S_Exported_Constants
 */
#define I2S_DMA_ENABLE                              ((uint32_t)0x0)
#define I2S_DMA_DISABLE                             (I2S_CTRL_MODE_MSK)
/** \} */

#define IS_I2S_DMA_CMD(CMD)       (((CMD) == I2S_DMA_ENABLE) || ((CMD) == I2S_DMA_DISABLE))

/**
 * \defgroup    I2S_Interrupt_Definition   I2S Interrupt Definition
 * \{
 * \ingroup     I2S_Exported_Constants
 */
#define I2S_INT_TX_IDLE                             (I2S_TX_IDLE_MSK)
#define I2S_INT_RF_EMPTY                            (I2S_RF_EMPTY_MSK)
#define I2S_INT_TF_EMPTY                            (I2S_TF_EMPTY_MSK)
#define I2S_INT_RF_FULL                             (I2S_RX_FULL_MSK)
#define I2S_INT_TF_FULL                             (I2S_TX_FULL_MSK)
#define I2S_INT_RX_READY                            (I2S_READY_TO_RX_MSK)
#define I2S_INT_TX_READY                            (I2S_READY_TO_TX_MSK)
/** \} */

#define IS_I2S_INT_CONFIG(INT)          (((INT) == I2S_INT_TX_IDLE) || ((INT) == I2S_INT_RF_EMPTY) || \
                                         ((INT) == I2S_INT_TF_EMPTY) || ((INT) == I2S_INT_RF_FULL) || \
                                         ((INT) == I2S_INT_TF_FULL) || ((INT) == I2S_INT_RX_READY) || \
                                         ((INT) == I2S_INT_TX_READY) )

/**
 * \defgroup   I2S_Clear_Interrupt_Definition     I2S Clear Interrupt Definition
 * \{
 * \ingroup     I2S_Exported_Constants
 */
#define I2S_CLEAR_INT_RX_READY                      (I2S_RX_CLEAR_INT_MSK)
#define I2S_CLEAR_INT_TX_READY                      (I2S_TX_CLEAR_INT_MSK)
/** \} */

