ART-Badge/SDK/libraries/inc/peripheral/rtl876x_i2s.h
    return RESET;
}

/**
 * \brief   Get BClk clock status.
 * \param[in] I2Sx: To select I2Sx peripheral, where x can be: 0 or 1.
 * \return  Execution status.
 * \retval  SET: BLCK is updating.
 * \retval  RESET: BLCK update is done.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void i2s_demo(void)
 * {
 *     FlagStatus status = I2S_GetBClkStatus(I2S0);
 * }
 * \endcode
 */
__STATIC_INLINE FlagStatus I2S_GetBClkStatus(I2S_TypeDef *I2Sx)
{
    /* Check the parameters */
    assert_param(IS_I2S_ALL_PERIPH(I2Sx));

    if (I2Sx->BCLK_DIV & I2S_MI_NI_UPDATE_MSK)
    {
        return SET;
    }

    return RESET;
}

/**
 * \brief   Config channel type.
 * \param[in] I2Sx: To select I2Sx peripheral, where x can be: 0 or 1.
 * \param[in] I2S_ChannelType: The channel type used for the I2S communication.
 *      This parameter can be one of the following values:
 *      \arg I2S_Channel_Mono: Mono channel.
 *      \arg I2S_Channel_stereo: Stereo channel.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void i2s_demo(void)
 * {
 *     I2S_ConfigChannelType(I2S0, I2S_Channel_Mono);
 * }
 * \endcode
 */
__STATIC_INLINE void I2S_ConfigChannelType(I2S_TypeDef *I2Sx, uint32_t I2S_ChannelType)
{
    I2Sx->CTRL0 &= I2S_CHANNEL_TYPE_CLR;
    I2Sx->CTRL0 |= I2S_ChannelType;
}

/** \} */ /*End of group I2S_Exported_Functions */

#ifdef __cplusplus
}
#endif

#endif /* _RTL876x_I2S_H_ */




/******************* (C) COPYRIGHT 2017 Realtek Semiconductor Corporation *****END OF FILE****/

